# coding: utf-8
import telebot
import random
bot=telebot.TeleBot("token")


@bot.message_handler(commands=['start', 'help'])
def send_welcome(message):
    button=telebot.types.ReplyKeyboardMarkup(True)
    button.row('Жінка', 'Чоловік')
    bot.send_message(message.chat.id, "Ласкаво просимо в Gift Ideas! Щоб переглядати ідеї "+\
                                      "подарунків оберіть стать людини для якої вибираєте"+\
                                      " подарунок!", reply_markup=button)


gift_woman_dict={1:'Кружка з принтом «Мені не потрібен Google»', 2:'Термокружка керамічна «My love»', 3:'Кружка «Mr і Mrs»', \
                 4:'Чашка мешалка «Self Stirring Mug» червона', 5:'Шкатулка для чаю «Home» 6 відділень', 6:'Цукорниця «Sugar House Peleg Design»', \
                 7:'Постер в рамці «12 причин чому я тебе кохаю»', 8:'Мультирамка, 3 фотографії, «LOVE» біла', 9:'Вазон - кашпо «Garden» White', \
                 10:'Подушка «Mrs. Always Right»', 11:'Сейф-книга «Dictionary», середній, червоний', 12:'Годинник «Записка» синій маркер', \
                 13:'Нічник «Телефонна будка»', 14:'Плед з рукавами з флісу «Рожевий»', 15:'Тримач для книг «Лондонський міст»', \
                 16:'Фоторамка Prisma', 17:'Органайзер для прикрас «My Little Deer Qualy» Чорний', 18:'Міський рюкзак «Клітинка» білий', \
                 19:'Консерва-носок «Girl boss»', 20:'Таблетки щастя «Антиистерин»', 21:'Шоколадний набір «Для тебе з любов\'ю» new', \
                 22:'Подарунковий набір «Винний календар»', 23:'Букет комплімент «With vase» білий', 24:'Портативна батарея «Агов, Кіт!» 5000mah', \
                 25:'Надувний лежак «LAMZAC», помаранчевий', 26:'Чехол зі своїм фото', 27:'Парфумована вода Jfenzi Anathea жіноча 100мл', \
                 28:'Косметичка AuC2018-16-2', 29:'Подарунковий набір Eveline Туш для вій ReveLASHES', 30:'Декоративна косметика', \
                 31:'Подарунковий бокс', 32:'Друк на футболці', 33:'ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK ', \
                 34:'РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA RED', 35:'РОЗУМНА СКАКАЛКА TANGRAM SMART ROPE S GOLD', \
                 36:'СЕЛФІ-КІЛЬЦЕ LED ЛІХТАРИК НА БАТАРЕЙКАХ WHITE', 37:'ТРИМАЧ ДЛЯ ТЕЛЕФОНУ POPHOLDER КОСМОС', 38:'СЕЛФІ ПАЛКА З КАБЕЛЕМ XIAOMI'}

gift_woman_descrip={'Кружка з принтом «Мені не потрібен Google»': ('<b>'+"Кружка з принтом «Мені не потрібен Google» UA \n 119 грн.\n"+'</b>'+ \
                                                                "Керамічна чашка з оригінальним надписом. \n Можна придбати в магазині"+'<b>'+ \
                                                                " «Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                                                "м.Чернівці, вул. Руська 10 "+'</b>', open('F:/Курсова/Картинки/google.jpg', 'rb')), \
                'Термокружка керамічна «My love»': ('<b>'+"Термокружка керамічна «My love» \n 200 грн. \n"+'</b>'+"Сміливо наливайте в неї улюблені "+\
                                                "гарячі напої (чай, кава) і насолоджуйтеся ними в дорозі. Зберігається початкова температура  "+\
                                                "протягом 2 годин. Якісний, органічний пластик абсолютно нешкідливий для людини.\n Можна придбати "+\
                                                "в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+\
                                                '<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/termo.jpg', 'rb')), \
                'Кружка «Mr і Mrs»': ('<b>'+"Кружка «Mr і Mrs»\n 120 грн.\n "+'</b>'+"Парні кружки будуть подарунком не лише для неї, але й для "+\
                                "нього.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua"+\
                                "\n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/MrMrs.jpg', 'rb')), \
                'Чашка мешалка «Self Stirring Mug» червона':('<b>'+"Чашка мешалка «Self Stirring Mug» червона \n 299 грн.\n"+'</b>'+"За допомогою "+ \
                                                        "цієї чашки можна з легкістю перемішати чай або каву. Чашка працює від мізинчикових батарейок."+\
                                                        "Для тривалого використання чашки слід стежити, щоб у відсік з батарейками не потрапляла вода."+\
                                                        "Self Stirring Mug - стане оригінальним подарунком близькій людині або колеги.\n Можна "+\
                                                        "придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua"+\
                                                        '<b>'+"\n м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/selfMugRed.jpg','rb')), \
                'Шкатулка для чаю «Home» 6 відділень':('<b>'+"Шкатулка для чаю «Home» 6 відділень \n 336 грн.\n"+'</b>'+" Призначено для зберігання і подачі "+\
                                                "пакетованих сортів чаю. Також, може використовуватися для подачі різних сипучих складових, наприклад,"+ \
                                                " кольорового цукру.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на "+\
                                                "їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/teaHome.jpg','rb')), \
                'Цукорниця «Sugar House Peleg Design»':('<b>'+"Цукорниця «Sugar House Peleg Design» \n 640 грн.\n "+'</b>'+"Ви коли-небудь думали, "+ \
                                                "що ємність для цукру може бути дійсно оригінальною і навіть казковою? \n Можна придбати в магазині"+ \
                                                '<b>'+" «Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+ \
                                                "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/sugar.jpg','rb')), \
                'Постер в рамці «12 причин чому я тебе кохаю»':('<b>'+"Постер в рамці «12 причин чому я тебе кохаю» UA \n 150 грн.\n"+'</b>'+ \
                                                        "Стильний постер стане оригінальною прикрасою на будь-якій стіні, будь-то квартира або"+\
                                                        " робоче місце. А ще це не тільки простий спосіб освіжити інтер'єр, але і відмінний подарунок "+ \
                                                        "друзям і близьким. Постер друкується на фотопапері і вставляється в легку рамку з задником"+\
                                                        " і кріпленнями на стіну. \n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або "+\
                                                        "замовити на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                        open('F:/Курсова/Картинки/lovePoster.jpg','rb')), \
                'Мультирамка, 3 фотографії, «LOVE» біла':('<b>'+"Мультирамка, 3 фотографії, «LOVE» біла\n 175 грн.\n"+'</b>'+"Мультирамка може "+\
                                                "прикрасити інтер'єр, зібравши фото всіх близьких людей, фото з найбільш знакових подій, або місць"+\
                                                " які ви встигли відвідати.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                                " на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/loveWhite.jpg','rb')), \
                'Вазон - кашпо «Garden» White':('<b>'+"Вазон - кашпо «Garden» White\n 173 грн.\n"+'</b>'+"Керамічні горщики мають вагомі переваги: "+\
                                        "їх стінки пропускають повітря, потрібний кореневій системі рослин, коріння в таких вазонах уникають перегріву."+\
                                        " Істотний аргумент: кімнатна рослина в керамічному горщику виглядає дуже презентабельно!\n Можна придбати в "+ \
                                        "магазині"+'<b>'+" «Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n "+'</b>'+ \
                                        '<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/garden.jpg','rb')), \
                'Подушка «Mrs. Always Right»':('<b>'+"Подушка «Mrs. Always Right» \n 285 грн.\n"+'</b>'+"Цікавий напис на подушці обов’язково підніме"+\
                                        " настрій будь-якій дівчині.\n Можна придбати в магазині "+'<b>'+ "«Хочу вже»,"+'</b>'+" або замовити на "+\
                                        "їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/alwaysRight.jpg','rb')), \
                'Сейф-книга «Dictionary», середній, червоний':('<b>'+"Сейф-книга «Dictionary», середній, червоний \n 380 грн.\n"+'</b>'+"Книга-сейф "+ \
                                                        "стане чудовим подарунком. В ній можна зберігати гроші або щось цінне, якісь дрібнички, які"+ \
                                                        " ви боїтесь втратити.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                                        " на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                        open('F:/Курсова/Картинки/dictionaryRed.jpg','rb')), \
                'Годинник «Записка» синій маркер':('<b>'+"Годинник «Записка» синій маркер\n 440 грн.\n"+'</b>'+"Як відомо, ранок повинно бути добрим."+\
                                                "А що може бути приємніше, ніж знайти записочку на годиннику від коханої людини? Це цікава річ, "+\
                                                "одночасно і годинник і табло для приємних записок, або нагадувань.\n Можна придбати в магазині "+\
                                                '<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці,"+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/clockBlue.jpg','rb')), 
                'Нічник «Телефонна будка»':('<b>'+"Нічник «Телефонна будка»\n 450 грн.\n"+'</b>'+"Стильний і функціональний нічний світильник, "+\
                                        "виконаний в привабливому дизайні англійської телефонної будки. Випромінює м'який, приємний для очей світло."+\
                                        " Світильник може харчуватися від звичайних пальчикових батарейок (3 штук) або USB порту, що робить його "+\
                                        " практично універсальним.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому"+\
                                        " сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/nightlightPhone.jpg','rb')), \
                'Плед з рукавами з флісу «Рожевий»':('<b>'+"Плед з рукавами з флісу «Рожевий \n 499 грн.\n"+'</b>'+"Плед з рукавами - це дуже зручний"+\
                                                " і теплий аксесуар для будинку, дачі, офісу і природи. Займатися улюбленими справами вам буде набагато"+\
                                                " тепліше, ваші руки залишаються вільними, а ви в теплі і затишку.\n Можна придбати в магазині "+'<b>'+\
                                                "«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, "+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/pledpink.jpg','rb')), \
                'Тримач для книг «Лондонський міст»':('<b>'+"Тримач для книг «Лондонський міст»\n 750 грн.\n"+'</b>'+"Тримач для книг Лондонський міст,"+\
                                                " який утримає будь-яку кількість улюблених книг. Прекрасний функціональний декор в сучасний будинок."+\
                                                "\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті "+\
                                                "https://hochuvzhe.ua \n "+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/holderBookBridge.jpg','rb')), \
                'Фоторамка Prisma':('<b>'+"Фоторамка Prisma \n 768 грн.\n"+'</b>'+"Завдяки особливостям конструкції, рамка може як висіти на стіні,"+\
                                " так і стояти на столі або тумбі. При погляді спереду, задні частини рамки створюють цікавий ефект, який точно "+\
                                "припаде до смаку любителям оригінальності.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                " на їхньому сайті https://hochuvzhe.ua "+'<b>'+"\n м.Чернівці, вул. Руська 10"+'</b>', \
                                open('F:/Курсова/Картинки/prisma.jpg','rb')), \
                'Органайзер для прикрас «My Little Deer Qualy» Чорний':('<b>'+"Органайзер для прикрас «My Little Deer Qualy» Чорний\n 800 грн.\n"+'</b>'+\
                                                        "Ця яскрава підставка підійде для зберігання будь-яких дрібниць: від ювелірних прикрас і"+\
                                                        " косметики до браслетів, гаманців, телефонів і ключів ... Предмети завжди будуть під рукою"+\
                                                        " - їх зручно зберігати і легко підбирати до будь-якого вбрання.\n Можна придбати в магазині "+\
                                                        '<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                                        "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/tree.jpg','rb')), \
                'Міський рюкзак «Клітинка» білий':('<b>'+"Міський рюкзак «Клітинка» білий \n 724 грн.\n"+'</b>'+"Міцний матеріал і місткі відділення"+\
                                        " роблять цей рюкзак неймовірно практичним. Рюкзак виготовлений з міцної штучної шкіри. А неповторний "+\
                                        "дизайн підкреслить Ваш стиль і зробить відмінне доповнення до Вашого гардеробу.\n Можна придбати в магазині"+\
                                        '<b>'+" «Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                        "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/bagWhite.jpg','rb')), \
                'Консерва-носок «Girl boss»':('<b>'+"Консерва-носок «Girl boss» \n 149 грн.\n"+'</b>'+"Коли завжди все під контролем, мільйон "+\
                                        "зустрічей і для всіх є завдання. Цей подарунок для справжньої Girl BOSS.\n Можна придбати в магазині "+\
                                        '<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                        "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/girlBoss.jpg','rb')), \
                'Таблетки щастя «Антиистерин»':('<b>'+"Таблетки щастя «Антиистерин»\n 75 грн.\n"+'</b>'+"Позитивно впливає на емоційний стан людини.\n"+\
                                        "Упаковка: 2 блістера по 12 таблеток \n Склад: вітамін С\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+\
                                        '</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/pill_isterin.jpg','rb')), \
                'Шоколадний набір «Для тебе з любов\'ю» new':('<b>'+"Шоколадний набір «Для тебе з любов'ю» new\n 80 грн\n"+'</b>'+"Назва набору, "+\
                                                "його фарби і наповнення говорять самі за себе. Подаруйте його своїй половинці! У разі, якщо у Вас "+\
                                                "немає слів - шоколад скаже за Вас. Якщо ж слова знайшлися, то шоколад їх підтвердить.\n Можна придбати"+\
                                                " в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                                "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/chokopink.jpg','rb')), \
                'Подарунковий набір «Винний календар»':('<b>'+"Подарунковий набір «Винний календар»\n 1985 грн.\n"+'</b>'+"Склад:\n - Червоне сухе"+\
                                                " вино 0,7л \n - 'Винний' календар\n - Карамель з лавандою і вином - 200 мл\n - Крекер до вина в"+\
                                                " подарунковій коробці - 100 г\n - Аератор для вина\n - Подарункова упаковка.\n Можна придбати в"+\
                                                " магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                                "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/wine.jpg','rb')), \
                'Букет комплімент «With vase» білий':('<b>'+"Букет комплімент«With vase» білий \n 220 грн.\n"+'<b>'+"Букети із сухоцвітів здатні "+\
                                                "прикрасити і принести особливий настрій в будь-який будинок. Сухоцвіти довго зберігають свій "+\
                                                "естетичний зовнішній вигляд, тому будуть радувати Вас не один рік.\n Можна придбати в магазині "+\
                                                '<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці,"+\
                                                " вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/vaseWhite.jpg','rb')), \
                'Портативна батарея «Агов, Кіт!» 5000mah':('<b>'+"Портативна батарея «Агов, Кіт!» 5000mah \n 635 грн.\n"+'</b>'+"Павербанк "+\
                                                "укомплектований адаптерами: micro USB, USB Type-C, Lightning (iPhone \\ iPad), що дозволить зарядити "+\
                                                "не тільки смартфон, а й іншу переносну електроніку. На корпусі є також порт USB на 1А для зарядки ще "+\
                                                " одного гаджета і порт MicroUSB для зарядки самого павербанка.\n Можна придбати в магазині "+'<b>'+\
                                                "«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/batteryCat.jpg','rb')), \
                'Надувний лежак «LAMZAC», помаранчевий':('<b>'+"Надувний лежак «LAMZAC», помаранчевий\n 700 грн.\n"+'</b>'+"Крісло-диван Lamzac дуже "+\
                                                "простий у використанні, а для установки не вимагає ніяких інструментів, навичок або умінь. Потрібно "+\
                                                "просто повітря. Тиск можна регулювати і робити шезлонг м'якше або жорсткіше. Диван-шезлонг витримує "+\
                                                "до 200 кг і може бути використаний на будь-якій поверхні.\n Можна придбати в магазині "+'<b>'+\
                                                "«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/lamzacOrange.jpg','rb')), \
                'Чехол зі своїм фото':('<b>'+"Чехол зі своїм фото\n 169-199 грн\n"+'</b>'+"Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+\
                                " або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                open('F:/Курсова/Картинки/girlChehol.jpg','rb')), \
                'Парфумована вода Jfenzi Anathea жіноча 100мл':('<b>'+"Парфумована вода Jfenzi Anathea жіноча 100мл\n 399,00 грн.\n"+'</b>'+"Вишукані"+\
                                                " та ніжні парфуми приваблюють своїм витонченим і неординарним букетом. Неймовірна легкість, чарівність"+\
                                                " і чуттєвість зливаються в єдину симфонію, надаючи своїй власниці особливого шарму.\n Різноманітний "+\
                                                "асортимент парфумів за цінами, які коливаються від 50 грн – до 3000 грн\n Можна придбати в магазині"+\
                                                '<b>'+" «Єва».\n"+ "м.Чернівці вул. Головна 200, вул.О.Кобилянської 16, вул. 28 червня 2, проспект "+\
                                                "Незалежності 80"+'</b>', open('F:/Курсова/Картинки/girlPerfume.jpg','rb')), \
                'Косметичка AuC2018-16-2':('<b>'+"Косметичка AuC2018-16-2\n 89,90 грн.\n"+'</b>'+" Косметичка – необхідний аксесуар для кожної "+\
                                        "дівчини, підходить для зберігання кометологічних і декоративних засобів.\n Можна придбати в магазині "+'<b>'+\
                                        "«Єва».\n м.Чернівці вул. Головна 200, вул.О.Кобилянської 16, вул. 28 червня 2, проспект Незалежності 80"+\
                                        '</b>', open('F:/Курсова/Картинки/cosmeticBag.jpg','rb')), \
                'Подарунковий набір Eveline Туш для вій ReveLASHES':('<b>'+"Подарунковий набір Eveline Туш для вій ReveLASHES, 10мл + Олівець "+\
                                                "контурний для очей з точилкою EYELINER PENCIL чорний + Сироватка для вій 5в1 SOS LASH BOOSTER, 10мл\n"+\
                                                "199,00 грн. \n"+'</b>'+"Можна придбати в магазині "+'<b>'+"«Єва».\n м.Чернівці вул. Головна 200, "+\
                                                "вул.О.Кобилянської 16, вул. 28 червня 2, проспект Незалежності 80"+'</b>', \
                                                open('F:/Курсова/Картинки/EvelineCosmetic.jpg','rb')), \
                'Декоративна косметика':('<b>'+"Декоративна косметика \n"+'</b>'+"Декоративна косметика ніколи не буде зайвою будь-якій дівчині. "+\
                                        "Тому це чудовий подарунок на будь-яке свято\n Можна придбати в магазині "+'<b>'+"«Єва».\n м.Чернівці вул."+\
                                        "Головна 200, вул.О.Кобилянської 16, вул. 28 червня 2, проспект Незалежності 80"+'</b>', \
                                        open('F:/Курсова/Картинки/cosmetics.jpg','rb')), \
                'Подарунковий бокс':('<b>'+"Подарунковий бокс\n 505 грн\n"+'</b>'+"Склад(можна змінювати):\n -Дорожня косметичка\n -Обкладинка на паспорт"+\
                                "\n-Кружка кемпер \n -Значок\n -Магніт\n -Валентинка\n -Топпер\n Можна придбати в магазині "+'<b>'+"«Презентвіль»\n "+\
                                "м.Чернівці, проспект Незалежності 127, вул.Братів Руснаків 14"+'</b>', open('F:/Курсова/Картинки/girlGiftBox.jpg','rb')), \
                'Друк на футболці':('<b>'+"Друк на футболці\n Від 150 грн\n"+'</b>'+"Оригінальні футболки - з вашими ідеями, на любий смак, "+\
                                "буде чудовим подарунком.\n Можна придбати в магазині "+'<b>'+"«Презентвіль»\n м.Чернівці, проспект Незалежності 127,"+\
                                " вул.Братів Руснаків 14"+'</b>', open('F:/Курсова/Картинки/T-shirtPrint.jpg','rb')), \
                'ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK ':('<b>'+"ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK\n 899 грн\n"+'</b>'+"Xiaomi Mi Band 3 – це "+\
                                                "поєднання стильного дизайну, розширеного функціоналу та додаткового захисту.\n Можна придбати в "+\
                                                "магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n "+\
                                                '<b>'+"м. Чернівці, вул. Героїв Майдану, 1В, пр. Незалежності, 129Д , вул. Мусоргського, 2а, "+\
                                                "вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                                open('F:/Курсова/Картинки/fitnesBracelet.jpg','rb')), \
                'РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA RED':('<b>'+"РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA RED \n 1599 грн\n"+'</b>'+\
                                                "Opus One Smart Umbrella – це перша в світі смарт-парасолька, завдяки якій його власник зможе "+\
                                                "дізнаватись актуальний прогноз погоди, оперативно отримувати сповіщення, захистити себе від "+\
                                                "крадіжки смартфону та ще багато чого. Для підтримки зв'язку зі смартфонами тут передбачений "+\
                                                "Bluetooth-модуль.\n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити на "+\
                                                "їхньому сайті https://mta.ua \n"+'<b>'+"м. Чернівці, вул. Героїв Майдану, 1В, пр. Незалежності, "+\
                                                "129Д , вул. Мусоргського, 2а, вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+\
                                                '</b>', open('F:/Курсова/Картинки/umbrellaRed.jpg','rb')), \
                'РОЗУМНА СКАКАЛКА TANGRAM SMART ROPE S GOLD':('<b>'+"РОЗУМНА СКАКАЛКА TANGRAM SMART ROPE S GOLD \n 2699 грн\n"+'</b>'+" Smart Rope - "+\
                                                "це розумна скакалка, яка здійснює двосторонній зв'язок зі смартфоном за допомогою Bluetooth 4.0 LE. "+\
                                                "Розумна скакалка Smart Rope може показувати три параметра: число зроблених стрибків, кількість "+\
                                                "спалених калорій і загальний час тренування. Щоб перейти від одного результату до іншого, досить "+\
                                                "перемкнути режим спеціальною кнопкою, розміщеною на рукоятці смарт-скакалки.\n Можна придбати в "+\
                                                "магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+\
                                                "м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, "+\
                                                "265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/goldRope.jpg','rb')),\
                'СЕЛФІ-КІЛЬЦЕ LED ЛІХТАРИК НА БАТАРЕЙКАХ WHITE':('<b>'+"СЕЛФІ-КІЛЬЦЕ LED ЛІХТАРИК НА БАТАРЕЙКАХ WHITE \n 275 грн\n"+'</b>'+"Селфі-кільце"+\
                                                " на батарейках – це чудова можливість зняти відмінне фото в будь-яких умовах. Не важливо, наскільки "+\
                                                "погане освітлення в приміщенні або на вулиці, усього декілька секунд для того, щоб закріпити цей "+\
                                                "пристрій, буде достатньо для початку вашої фотосесії. \n Можна придбати в магазині "+'<b>'+\
                                                "«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул."+\
                                                "Героїв Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, 265А - ТРЦ 'DEPOt', "+\
                                                "вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/selfiLight.jpg','rb')), \
                'ТРИМАЧ ДЛЯ ТЕЛЕФОНУ POPHOLDER КОСМОС':('<b>'+"ТРИМАЧ ДЛЯ ТЕЛЕФОНУ POPHOLDER КОСМОС ЯСКРАВИЙ\n 129 грн\n"+'</b>'+" Popholder значно "+\
                                        "спростить Вашу роботу з телефоном або планшетом, забезпечуючи зручні рухи для набору текстових повідомлень "+\
                                        "друзям, зйомки високоякісних фотографій, чітких cелфі, час за іграми, читання книг або здійснення покупок на "+\
                                        "планшеті.\n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті "+\
                                        "https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а,"+\
                                        " вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                        open('F:/Курсова/Картинки/popholder.jpg','rb')), \
                'СЕЛФІ ПАЛКА З КАБЕЛЕМ XIAOMI':('<b>'+"СЕЛФІ ПАЛКА З КАБЕЛЕМ XIAOMI CABLE BLACK \n 399 грн\n"+'</b>'+"Монопод Xiaomi Mi Selfie Stick "+\
                                        "дозволяє отримувати вражаючі селфі за будь-яких обставин. Він обладнаний телескопічною штангою і шаровими "+\
                                        "кріпленням для смартфона. З його допомогою можна вибирати оптимальний ракурс зйомки як для класичних "+\
                                        "автопортретів, так і для групових фотографій. \n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+\
                                        " або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності,"+\
                                        " 129Д , вул. Мусоргського, 2а, вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                        open('F:/Курсова/Картинки/selfiStick.jpg','rb'))}

gift_man_dict={1:'Кружка «Strong coffee always fresh»', 2:'Чашка «Комп\'ютерна клавіша» 3шт.', 3:'Камені для Віскі «Whiskey Stones» білі', \
                4:'Чашка мешалка «Self Stirring Mug» чорна', 5:'Набір чарок «Череп» 4 шт', 6:'Термокружка «Фотооб\'єктив Caniam» з підставкою, білий', \
                7:'USB cвітильник «Космонавт»', 8:'Подушка «Суперчоловік» UA', 9:'Подушка кругла «Євро»', 10:'Сейф-книга «Dictionary», чорний', \
                11:'Плед з рукавами з флісу «Синій»', 12:'Будильник «Дожени мене» чорний', 13:'Тримач для книг «Велосипед»', \
                14:'Гіпсова скульптура - органайзер «David» White', 15:'Консерва-носок «Пофігиста»', 16:'Таблетки щастя «Антижратин»', \
                17:'Шоколадний набір «Для справжнього чоловіка»', 18:'Подарунковий набір «Black Style»', 19:'Алкогра «Шахмати»', \
                20:'Портативна батарея Повербанк «Океан» 5000mah', 21:'Надувний лежак «LAMZAC», голубий', \
                22:'Проектор для смартфона «Smartphone Projector Luckies»', 23:'Чехол зі своїм фото', 24:'Туалетна вода Jeanne Arthes COLONIAL', \
                25:'Подарунковий набір Nivea men Ультра', 26:'Подарунковий бокс', 27:'Друк на футболці', 28:'Друк на світшоті', \
                29:'ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK', 30:'РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA BLACK', \
                31:'КОЛОНКА БЕЗПРОВІДНА SVEN PS-45BL', 32:'ШАПКА BLUETOOTH-ГАРНІТУРА ARCHOS', 33:'СТОЛИК ПІД НОУТБУК', \
                34:'КВАДРОКОПТЕР AIRPHIBIAN PEG108 BLACK', 35:'3D-РУЧКА 3D PEN RP-100B MOSAIC'}

gift_man_descrip={'Кружка «Strong coffee always fresh»':('<b>'+"Кружка «Strong coffee always fresh»\n 95 грн.\n"+'</b>'+"Керамічна чашка cтане "+\
                                                "відмінним подарунком як для чоловіка, так і для жінки. Цікавий принт підкреслить стиль і настрій."+\
                                                "\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті "+\
                                                "https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/coffeStrong.jpg','rb')), \
                'Чашка «Комп\'ютерна клавіша» 3шт.':('<b>'+"Чашка «Комп'ютерна клавіша» 3шт.\n 185 грн.\n"+'</b>'+"Чашечки можна використовувати "+\
                                                "не тільки за прямим призначенням, але і в якості тарілочок для десертів і салатів, як Вазончик "+\
                                                "для квітів або підставки для канцелярії. Чашки, завдяки своєму незвичайному і елегантному дизайну, "+\
                                                "стануть шикарним подарунком не тільки запеклому комп'ютерному користувачеві, але і людині, яка "+\
                                                "працює в сфері IT технологій. \n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або "+\
                                                "замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/compCup.jpg','rb')), \
                'Камені для Віскі «Whiskey Stones» білі':('<b>'+"Камені для Віскі «Whiskey Stones» білі\n 220 грн.\n"+'</b>'+"Whiskey Stones - "+\
                                        "Камені для віскі , що дозволяють охолодити напій до потрібної температури,  не розбавляючи його. Зберігає "+\
                                        "первозданний смак і тонкий букет напою.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                        " на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/whiskeyStones.jpg','rb')), \
                'Чашка мешалка «Self Stirring Mug» чорна':('<b>'+"Чашка мешалка «Self Stirring Mug» чорна\n 299 грн.\n"+'</b>'+"За допомогою цієї "+\
                                        "чашки можна з легкістю перемішати чай або каву. Чашка працює від мізинчикових батарейок. Для тривалого "+\
                                        "використання чашки слід стежити, щоб у відсік з батарейками не потрапляла вода. Self Stirring Mug - стане "+\
                                        "оригінальним подарунком близькій людині або колеги. \n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+\
                                        " або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/selfMugBlack.jpg','rb')), \
                'Набір чарок «Череп» 4 шт':('<b>'+"Набір чарок «Череп» 4 шт\n 260 грн.\n"+'</b>'+"Набір чарок «Череп» може послужити оригінальним "+\
                                        "презентом для будь-якого серйозного чоловіка. \n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+\
                                        " або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/scullCup.jpg','rb')), \
                'Термокружка «Фотооб\'єктив Caniam» з підставкою, білий':('<b>'+"Термокружка «Фотооб'єктив Caniam» з підставкою, білий\n 360 грн.\n"+\
                                        '</b>'+"Чашка об'єктив - оригінальний подарунок для фотографа, репортера і будь-якої творчої людини. Кухоль "+\
                                        "можна використовувати для гарячих або холодних напоїв, як склянку для олівців або скарбничку.\n Можна "+\
                                        "придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+\
                                        '<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/photoTermo.jpg','rb')), \
                'USB cвітильник «Космонавт»':('<b>'+"USB cвітильник «Космонавт»\n 255 грн.\n"+'</b>'+"З таким чудо-світильником Вам не доведеться "+\
                                        "турбувати оточуючих. Космонавт допоможе Вам працювати за комп'ютером протягом темного часу доби, а його вид "+\
                                        "обов'язково підніме Вам настрій.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на"+\
                                        " їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/spaceman.jpg','rb')), \
                'Подушка «Суперчоловік» UA':('<b>'+"Подушка «Суперчоловік» UA\n 285 грн.\n"+'</b>'+"Чудовий подарунок, який здатний підняти настрій "+\
                                "не тільки винуватцеві торжества, а й всієї компанії.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+\
                                " або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                open('F:/Курсова/Картинки/superman.jpg','rb')), \
                'Подушка кругла «Євро»':('<b>'+"Подушка кругла «Євро»\n 341 грн.\n"+'</b>'+"Оригінальна подушка точно не залишиться без уваги.\n Можна "+\
                                "придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/euro.jpg','rb')), \
                'Сейф-книга «Dictionary», чорний':('<b>'+"Сейф-книга «Dictionary», середній, чорний\n 380 грн.\n"+'</b>'+"Книга-сейф стане чудовим "+\
                                        "подарунком. В ній можна зберігати гроші або щось цінне, якісь дрібнички, які ви боїтесь втратити.\n Можна "+\
                                        "придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                        "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/dictionaryBlack.jpg','rb')), \
                'Плед з рукавами з флісу «Синій»':('<b>'+"Плед з рукавами з флісу «Синій»\n 499 грн.\n"+'</b>'+"Плед з рукавами - це дуже зручний "+\
                                        "і теплий аксесуар для будинку, дачі, офісу і природи. Займатися улюбленими справами вам буде набагато тепліше,"+\
                                        " ваші руки залишаються вільними, а ви в теплі і затишку.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+ \
                                        '</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/pledBlue.jpg','rb')), \
                'Будильник «Дожени мене» чорний':('<b>'+"Будильник «Дожени мене» чорний\n 650 грн.\n"+'</b>'+"Феноменальний винахід для любителів "+\
                                        "поспати! Справа в тому, щоб вимкнути в ньому звук, вам спочатку треба зловити будильник!\n Можна придбати в "+\
                                        "магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+ \
                                        "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/alarmClock.jpg','rb')), \
                'Тримач для книг «Велосипед»':('<b>'+"Тримач для книг «Велосипед»\n 750 грн\n"+'</b>'+"Досить цікавий дизайн для розміщення книг, "+\
                                        "сподобається будь-якому любителю книг.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                        " на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/holderBookBike.jpg','rb')), \
                'Гіпсова скульптура - органайзер «David» White':('<b>'+"Гіпсова скульптура - органайзер «David» White\n 1120 грн\n"+'</b>'+"Може "+\
                                                "використовуватися як:\n - Елемент декору\n - Вазон під горщик\n - Підсвічник\n - Холдер під канцелярію"+\
                                                "\n - Манекен під прикраси, головні убори та ін.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+ \
                                                '</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                                open('F:/Курсова/Картинки/gipsDavid.jpg','rb')), \
                'Консерва-носок «Пофігиста»':('<b>'+"Консерва-носок «Пофігиста»\n 149 грн.\n"+'</b>'+"Пох** на всі проблеми і негаразди? Ти завжди на "+\
                                        "ПОЗИТИВЧИКУ і тобі море по коліно? Тоді ці шкарпетки спеціально для тебе! «Шкарпетки пофігіста», замість "+\
                                        "тисячі слів.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті "+\
                                        "https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/manSocks.jpg','rb')), \
                'Таблетки щастя «Антижратин»':('<b>'+"Таблетки щастя «Антижратин»\n 75 грн.\n"+'</b>'+"Зроблено на основі розробок провідних "+\
                                        "позитивних і життєрадісних фармакологів світу, м'яко і ніжно впливає на психіку людини.\n Упаковка: 2 блістера"+\
                                        " по 12 таблеток\n Склад: вітамін С\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити "+\
                                        "на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                        open('F:/Курсова/Картинки/pill_antizratin.jpg','rb')), \
                'Шоколадний набір «Для справжнього чоловіка»':('<b>'+"Шоколадний набір «Для справжнього чоловіка» ua new\n 80 грн.\n"+'</b>'+"Оригінальний"+\
                                                " шоколадний набір «Для справжнього чоловіка» містить 12 плиточок справжнього чорного шоколаду. "+\
                                                "Дизайн кожної етикетки зображує обов'язкові завдання, які необхідно виконати справжньому чоловікові: "+\
                                                "«Створити сім'ю», «Прийти на допомогу другові», «Стати героєм для коханої».\n Можна придбати в магазині "+\
                                                '<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/chokoblue.jpg','rb')), \
                'Подарунковий набір «Black Style»':('<b>'+"Подарунковий набір «Black Style»\n 2270 грн.\n"+'</b>'+"Склад:\n - Віскі Jack Daniels - 0,5 л"+\
                                        "- Келихи для віскі - 2 шт.\n - Підставки під келихи кам'яні - 2 шт.\n - Pawer Bank Urban Revolt\n - Подарункова"+\
                                        " упаковка.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті "+\
                                        "https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/JackDaniels.jpg','rb')), \
                'Алкогра «Шахмати»':('<b>'+"Алкогра «Шахмати»\n 600 грн.\n"+'</b>'+"Всі фігури є скляними чарками з нанесеними на них зображеннями "+\
                                "стандартних шахових фігур. Позбавляючи противника пішаки або ферзя, на шаховому полі алкогольної битви, зобов'язує "+\
                                "його випивати вміст кожної фігури, що вибула.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити"+\
                                " на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                open('F:/Курсова/Картинки/alcoChess.jpg','rb')), \
                'Портативна батарея Повербанк «Океан» 5000mah':('<b>'+"Портативна батарея Повербанк «Океан» 5000mah\n 635 грн.\n"+'</b>'+"Павербанк "+\
                                                "укомплектований адаптерами: micro USB, USB Type-C, Lightning (iPhone \\ iPad), що дозволить зарядити "+\
                                                "не тільки смартфон, а й іншу переносну електроніку.На корпусі є також порт USB на 1А для зарядки ще "+\
                                                "одного гаджета і порт MicroUSB для зарядки самого павербанка.\n Можна придбати в магазині "+'<b>'+\
                                                "«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, "+\
                                                "вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/batteryOcean.jpg','rb')), \
                'Надувний лежак «LAMZAC», голубий':('<b>'+"Надувний лежак «LAMZAC», голубий\n 700 грн\n"+'</b>'+"Надувний диван Lamzac - прекрасне "+\
                                        "пристосування для активного відпочинку, туризму, відпочинку на пляжі. Завдяки своєму компактному дизайну і "+\
                                        "малій вазі, ви можете легко брати гамак Ламзаки на будь-які прогулянки і в подорожі.\n Можна придбати в "+\
                                        "магазині "+'<b>'+"«Хочу вже»,"+'</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+\
                                        "м.Чернівці, вул. Руська 10"+'</b>', open('F:/Курсова/Картинки/lamzacBlue.jpg','rb')), \
                'Проектор для смартфона «Smartphone Projector Luckies»':('<b>'+"Проектор для смартфона «Smartphone Projector Luckies»\n 832 грн.\n"+\
                                                "Проектор для смартфона Smartphone Projector від Luckies з легкістю перетворить ваш гаджет в "+\
                                                "портативний кінотеатр. Вечірка в будинку з друзями або просто перегляд улюбленого фільму, цей "+\
                                                "проектор для телефону підходить для будь-яких подій.\n Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+\
                                                '</b>'+" або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>',\
                                                open('F:/Курсова/Картинки/phoneProjector.jpg','rb')), \
                'Чехол зі своїм фото':('<b>'+"Чехол зі своїм фото\n 169-199 грн\n"+'</b>'+"Можна придбати в магазині "+'<b>'+"«Хочу вже»,"+'</b>'+\
                                " або замовити на їхньому сайті https://hochuvzhe.ua \n"+'<b>'+"м.Чернівці, вул. Руська 10"+'</b>', \
                                open('F:/Курсова/Картинки/manChehol.jpg','rb')), \
                'Туалетна вода Jeanne Arthes COLONIAL':('<b>'+"Туалетна вода Jeanne Arthes COLONIAL CLUB YPSOS чоловіча 100мл\n 449,00 грн.\n"+'</b>'+\
                                        "Бездоганне відчуття стилю – відмінна риса справжнього джентльмена. У побудові завершеного образу не "+\
                                        "останню роль відіграє аромат, який повинен підходити власнику та підкреслювати кращі його риси.\n Є великий "+\
                                        "асортимент різних парфумів, за різними цінами , від 100 грн -  до 3000 грн\n Можна придбати в магазині "+'<b>'+\
                                        "«Єва».\n м.Чернівці вул. Головна 200, вул.О.Кобилянської 16, вул. 28 червня 2, проспект Незалежності 80"+'</b>',\
                                        open('F:/Курсова/Картинки/manPerfume.jpg','rb')), \
                'Подарунковий набір Nivea men Ультра':('<b>'+"Подарунковий набір Nivea men Ультра (косм) 2018\n 289,00 грн.\n"+'</b>'+"Якісні засоби "+\
                                        "для догляду за чутливою шкірою забезпечать належну турботу після гоління та дозволять відчувати себе "+\
                                        "комфортно та впевнено протягом усього дня. Подарунковий набір складається з трьох продуктів.\n Можна придбати "+\
                                        "в магазині "+'<b>'+"«Єва».\n м.Чернівці вул. Головна 200, вул.О.Кобилянської 16, вул. 28 червня 2, проспект "+\
                                        "Незалежності 80"+'</b>', open('F:/Курсова/Картинки/niveaMan.jpg','rb')), \
                'Подарунковий бокс':('<b>'+"Подарунковий бокс\n 585 грн\n"+'</b>'+"Склад(можна змінювати):\n -Шоколад\n -Солодощі\n -Свічка\n"+\
                                "-Кружка\n -Обкладинка на паспорт\n -Топпер\n -Листівка\n Можна придбати в магазині "+'<b>'+"«Презентвіль»\n"+\
                                "м.Чернівці , проспект Незалежності 127, вул.Братів Руснаків 14"+'</b>', \
                                open('F:/Курсова/Картинки/manGiftBox.jpg','rb')), \
                'Друк на футболці':('<b>'+"Друк на футболці\n Від 150 грн\n"+'</b>'+"Оригінальні футболки - з вашими ідеями, на любий смак, буде "+\
                                "чудовим подарунком.\n Можна придбати в магазині "+'<b>'+"«Презентвіль»\n м.Чернівці , проспект Незалежності 127, "+\
                                "вул.Братів Руснаків 14"+'</b>', open('F:/Курсова/Картинки/T-shirtPrint.jpg','rb')),\
                'Друк на світшоті':('<b>'+"Друк на світшоті\n Від 470 грн\n"+'</b>'+"Світшот з власним написом буде цікавим подарунком.\n Можна "+\
                                "придбати в магазині "+'<b>'+"«Презентвіль»\n м.Чернівці , проспект Незалежності 127, вул.Братів Руснаків 14"+'</b>', \
                                open('F:/Курсова/Картинки/switshotPrint.jpg','rb')), \
                'ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK':('<b>'+"ФІТНЕС-БРАСЛЕТ XIAOMI MI BAND 3 BLACK \n 899 грн\n"+'</b>'+"Xiaomi Mi Band 3 – це "+\
                                        "поєднання стильного дизайну, розширеного функціоналу та додаткового захисту.\n Можна придбати в магазині "+\
                                        '<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул."+\
                                        "Героїв Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, 265А - ТРЦ 'DEPOt', "+\
                                        "вул.Руська, 248Е - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/fitnesBracelet.jpg','rb')), \
                'РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA BLACK':('<b>'+"РОЗУМНА ПАРАСОЛЬКА OPUS ONE SMART UMBRELLA BLACK \n 1599 грн\n"+'</b>'+\
                                        "Opus One Smart Umbrella – це перша в світі смарт-парасолька, завдяки якій його власник зможе дізнаватись "+\
                                        "актуальний прогноз погоди, оперативно отримувати сповіщення, захистити себе від крадіжки смартфону та ще "+\
                                        "багато чого. Для підтримки зв'язку зі смартфонами тут передбачений Bluetooth-модуль.\n Можна придбати в "+\
                                        "магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+\
                                        "м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, 265А - "+\
                                        "ТРЦ 'DEPOt', вул.Руська, 248Е - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/umbrellaBlack.jpg','rb')),\
                'КОЛОНКА БЕЗПРОВІДНА SVEN PS-45BL':('<b>'+"КОЛОНКА БЕЗПРОВІДНА SVEN PS-45BL BLACK 00410067 \n 339 грн\n"+'</b>'+" Музику люблять "+\
                                        "всі, тому колонка не буде зайвою.\n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити "+\
                                        "на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, 129Д , "+\
                                        "вул.Мусоргського, 2а, вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                        open('F:/Курсова/Картинки/musicColumn.jpg','rb')), \
                'ШАПКА BLUETOOTH-ГАРНІТУРА ARCHOS':('<b>'+"ШАПКА BLUETOOTH-ГАРНІТУРА ARCHOS MUSIC BEANY \n 464 грн\n"+'</b>'+"Шапочка ARCHOS Music "+\
                                        "Beany являє собою бездротову гарнітуру, вбудовану в якісну і красиву, в'язану шапочку. Пристрій дозволяє "+\
                                        "слухати улюблену музику з будь-якого Bluetooth-пристрою, де б Ви не знаходилися.\n Можна придбати в магазині "+\
                                        '<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв "+\
                                        "Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, 265А - ТРЦ 'DEPOt', вул.Руська, 248Е"+\
                                        " - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/musicHat.jpg','rb')), \
                'СТОЛИК ПІД НОУТБУК':('<b>'+"СТОЛИК ПІД НОУТБУК 14-17 UFT FREETABLE-3 BLACK \n 698 грн \n"+'</b>'+"Столик вирішить проблему ноутбука "+\
                                "в ліжку. Тепер працювати буде на багато зручніше.\n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+\
                                " або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, "+\
                                "129Д , вул.Мусоргського, 2а, вул.Головна, 265А - ТРЦ 'DEPOt', вул.Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                open('F:/Курсова/Картинки/tableLaptop.jpg','rb')), \
                'КВАДРОКОПТЕР AIRPHIBIAN PEG108 BLACK':('<b>'+"КВАДРОКОПТЕР AIRPHIBIAN PEG108 BLACK \n 1199 грн\n"+'</b>'+"Квадрокоптер буде чудовим "+\
                                        "подарунком для того хто любить знімати з висоти, певні краєвиди та події.\n Можна придбати в магазині "+\
                                        '<b>'+"«Мультимедіа»"+'</b>'+" або замовити на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв"+\
                                        " Майдану, 1В, пр.Незалежності, 129Д , вул.Мусоргського, 2а, вул.Головна, 265А - ТРЦ 'DEPOt', вул.Руська, "+\
                                        "248Е - ТРЦ 'Екватор'"+'</b>', open('F:/Курсова/Картинки/kvadrokopter.jpg','rb')), \
                '3D-РУЧКА 3D PEN RP-100B MOSAIC':('<b>'+"3D-РУЧКА 3D PEN RP-100B MOSAIC \n 949 грн\n"+'</b>'+"3D-ручка Cactus CS-3D-PEN E-ергономічний"+\
                                        " гаджет з плавними обводами корпусу, що ідеально підходить для створення складних тривимірних моделей. "+\
                                        "На відміну від принтерів та іншого стаціонарного обладнання, вона легко поміщається в невелику сумочку, "+\
                                        "рюкзак або сумку з інструментами.\n Можна придбати в магазині "+'<b>'+"«Мультимедіа»"+'</b>'+" або замовити"+\
                                        " на їхньому сайті https://mta.ua \n"+'<b>'+"м.Чернівці, вул.Героїв Майдану, 1В, пр.Незалежності, 129Д , "+\
                                        "вул. Мусоргського, 2а, вул. Головна, 265А - ТРЦ 'DEPOt', вул. Руська, 248Е - ТРЦ 'Екватор'"+'</b>', \
                                        open('F:/Курсова/Картинки/3dPen.jpg','rb'))}

@bot.message_handler(content_types='text')
def button_type(message):
        if message.text=='Жінка':
                mess,photo=gift_woman_descrip[gift_woman_dict[random.randint(1,38)]]
                bot.send_message(message.chat.id, mess , parse_mode='HTML')
                bot.send_photo(message.chat.id, photo)
        elif message.text=='Чоловік':
                info, picture=gift_man_descrip[gift_man_dict[random.randint(1,35)]]
                bot.send_message(message.chat.id, info, parse_mode='HTML')
                bot.send_photo(message.chat.id, picture)

bot.polling()

